TProfileST2/casebase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hpc4peFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1.0;

writeControl    timeStep;

writeInterval   100;

purgeWrite      1;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs ("libusertempBirdCarreau.so");

#include outletAreas;

functions
{
    functionObj
    {
        type        fobjArea;
        libs        ("libfobjAreaFunctionObject.so");  
        
        #include  outletPatches;           
        stepSize   1;
	tolerance  1e-3;
	minCounter 100;
    }      
}


//*********************************************************************//
